Барбершоп/DataProcessors/ОсновыПрограммирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ОсновыПрограммирования</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Барбершоп/AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склад</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Барбершоп/AccumulationRegisters/ЗаказКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказКлиентов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Барбершоп/AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудники</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Барбершоп/Documents/ЗаписьКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ЗаписьКлиента</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаказКлиентов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудники</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УслугаОказана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Барбершоп/DataProcessors/ОсновыПрограммирования/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура РаботаСКоллекциямиЗначений(Команда)
Массив = Новый Массив();

Массив.Добавить(1);
Массив.Добавить("Два");

ВложенныйМассив = Новый Массив();
ВложенныйМассив.Добавить('2003,07,10');

Массив.Добавить(ВложенныйМассив);

Сообщить(Массив[1]);
Сообщить(Массив[2][0]);
КонецПроцедуры

&НаСервере
Процедура РаботаСоСпискомЗначенийНаСервере()
	ТаблицаЗначений = Новый ТаблицаЗначений();
	ТаблицаЗначений.Колонки.Добавить("Представление");
	ТаблицаЗначений.Колонки.Добавить("Значение");
	
	НоваяСтрокаТаблицы = ТаблицаЗначений.Добавить();
	НоваяСтрокаТаблицы.Представление = "Первая строка";
	НоваяСтрокаТаблицы.Значение = "1";
	НоваяСтрокаТаблицы = ТаблицаЗначений.Добавить();
	НоваяСтрокаТаблицы.Представление = "Вторая строка";
	НоваяСтрокаТаблицы.Значение = "2";
	
	Сообщить(ТаблицаЗначений.Количество());
	
	ВыгруженнаяКолонка =   ТаблицаЗначений.ВыгрузитьКолонку("Значение");
	Сообщить(ТипЗнч(ВыгруженнаяКолонка));
	ТаблицаЗначений.Удалить(НоваяСтрокаТаблицы);
	Сообщить(ТаблицаЗначений.Количество());  
	Сообщить(ТаблицаЗначений[0].Представление);
КонецПроцедуры

&НаКлиенте
Процедура РаботаСоСпискомЗначений(Команда)
	РаботаСоСпискомЗначенийНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РаботаСоСтруктурамиИСоответствиями(Команда)
	МассивСтруктур = Новый Массив;	
	СтруктураПервая = Новый Структура("Представление, Значение", "Первая строка", "1");	
	СтруктураВторая = Новый Структура("Представление, Значение", "Вторая строка", "2");	
	МассивСтруктур.Добавить(СтруктураПервая);	
	МассивСтруктур.Добавить(СтруктураВторая);	
	Сообщить(МассивСтруктур[0].Представление);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура РаботаСПроцедурамиИФункциямиНаСервере()


КонецПроцедуры

&НаКлиенте
Процедура РаботаСПроцедурамиИФункциями(Команда)
	а = 2;  //1
	
	б = 4;
	
	РезультатФункции = СложитьДваЧислаФункция(а,б); //2
	
	Сообщить(РезультатФункции);
	
	РезультатПроцедуры = 0;   //3
	
	СложитьДваЧислаПроцедура(а,б, РезультатПроцедуры);
	
	Сообщить(РезультатПроцедуры);
	
	РезультатФункцииБезВозвратаЗначений = 0; //4
	
	СложитьДваЧислаФункцияБезВозвратаЗначения(а,б,     РезультатФункцииБезВозвратаЗначений);
	
	Сообщить(РезультатФункцииБезВозвратаЗначений); 
	
КонецПроцедуры

&НаКлиенте
Процедура ВводПоложительногоЧисла(Команда)	
	ПоказатьВводЧислаПользователя("Введите положительное число!");	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВводЧислаПользователя(ТекстПодсказки)
	
	ОбработкаВводаПользователя = Новый ОписаниеОповещения("ПоказатьВводЧислаЗавершение", ЭтотОбъект);
	
	ПоказатьВводЧисла(ОбработкаВводаПользователя, 0, ТекстПодсказки);  
	
			
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВводЧислаЗавершение(ВведенноеЧисло, Параметры)
	Экспорт
	
	Если ВведенноеЧисло <>Неопределено И ВведенноеЧисло > 0 Тогда
		
		Сообщить("Вы молодец!");
			
	ИначеЕсли ВведенноеЧисло = 0 Тогда
		
		ПоказатьВводЧислаПользователя("Вы ввели 0, повторите попытку!"); 
		
				
	Иначе
		
		ПоказатьВводЧислаПользователя("Вы ввели отрицательное число, повторите попытку!");
		
	КонецЕсли;
	
КонецПроцедуры 



&НаСервере
Процедура ПосмотретьСтруктуруХраненияТаблицСУБДНаСервере()
	МассивИменМетаданных = Новый Массив();
	МассивИменМетаданных.Добавить("РегистрНакопления.ТоварыНаСкладах");  
	
	МассивИменМетаданных.Добавить("РегистрНакопления.ЗаказКлиентов");
	МассивИменМетаданных.Добавить("РегистрНакопления.Продажи");
	
	СтруктураХранения = ПолучитьСтруктуруХраненияБазыДанных(МассивИменМетаданных);    
	Для Каждого СтрокаДанных Из СтруктураХранения Цикл
		ТекстСообщения = СтрШаблон("Имя таблицы в СУБД: %1, имя объекта в 1С: %2, назначение: %3", СтрокаДанных.ИмяТаблицыХранения, СтрокаДанных.Метаданные, СтрокаДанных.Назначение);
		Сообщить(ТекстСообщения);    
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьСтруктуруХраненияТаблицСУБД1(Команда)
	ПосмотретьСтруктуруХраненияТаблицСУБДНаСервере();
КонецПроцедуры


&НаСервере
Процедура ОбходГруппировокЗапросаНаСервере()
	 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаписьКлиентаУслуги.Номенклатура КАК Номенклатура,
		|	ЗаписьКлиентаУслуги.Количество КАК Количество,
		|	ЗаписьКлиентаУслуги.Сумма КАК Сумма,
		|	ЗаписьКлиента.Сотрудники КАК Сотрудники,
		|	ЗаписьКлиента.Клиент КАК Клиент
		|ИЗ
		|	Документ.ЗаписьКлиента.Услуги КАК ЗаписьКлиентаУслуги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаписьКлиента КАК ЗаписьКлиента
		|		ПО ЗаписьКлиентаУслуги.Ссылка = ЗаписьКлиента.Ссылка
		|ГДЕ
		|	ЗаписьКлиента.Проведен
		|ИТОГИ
		|	СУММА(Количество),
		|	СУММА(Сумма)
		|ПО
		|	ОБЩИЕ,
		|	Клиент";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаОбщийИтог.Следующий();		// Общий итог 
	
	Сообщить(СтрШаблон("Это общая группировка с суммой %1 и количеством %2", ВыборкаОбщийИтог.Сумма, ВыборкаОбщийИтог.Количество));
		
	ВыборкаКлиент = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаКлиент.Следующий() Цикл
		Сообщить(СтрШаблон("Это группировка по клиентам с суммой %1 и количеством %2", ВыборкаКлиент.Сумма, ВыборкаКлиент.Количество));
		
		ВыборкаДетальныеЗаписи = ВыборкаКлиент.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Сообщить(СтрШаблон("Это детальные записи по номенклатуре %1 с суммой %2 и количеством %3", ВыборкаДетальныеЗаписи.Номенклатура, ВыборкаДетальныеЗаписи.Сумма, ВыборкаДетальныеЗаписи.Количество));
			
		КонецЦикла;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры


&НаКлиенте
Процедура ОбходГруппировокЗапроса(Команда)
	ОбходГруппировокЗапросаНаСервере();
КонецПроцедуры
